console.log(`Є змінна х, якій ви надаєте довільне числове значення. 
Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'.
Перевірте  скрипт при a, що дорівнює 1, 0, -3`);

let x = 12;
let a = 0;

if (x != 0) {
    console.log(`Вірно`);
} else {
    console.log(`Невірно`);
}

if (a == 1 || a == 0 || a == -3) {
    console.log(`Вірно`);
} else {
    console.log(`Невірно`);
}

console.log(`________________________________________________________________`);

console.log(`Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код,
який перевірить, до якої четверті години попадає число
(в першу, другу, третю или четверту частину години).`);

let time = 36;

if (time >= 0 && time <= 15){
    console.log(`Число ${time} попадає в першу частину години!`);
} else if (time > 15 && time <= 30) {
    console.log(`Число ${time} попадає в другу частину години!`);
} else if (time > 30 && time <= 45) {
    console.log(`Число ${time} попадає в третю частину години!`);
} else if (time > 45 && time <= 59) {
    console.log(`Число ${time} попадає в четверту частину години!`);
} else {
    console.log(`Число ${time} число знаходиться вне диапазоні від 0 до 59!`);
}

console.log(`________________________________________________________________`);

console.log(`- У змінній day дано якесь число від 1 до 31.
Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).`);

let day = 23;

if (day >= 1 && day <= 10){
    console.log(`Число ${day} попадає в першу декаду місяця!`);
} else if (day > 10 && day <= 21) {
    console.log(`Число ${day} попадає в другу декаду місяця!`);
} else if (day > 21 && day <= 31) {
    console.log(`Число ${day} попадає в третю декаду місяця!`);
} else {
    console.log(`Число ${day}} число знаходиться вне диапазоні від 1 до 31!`);
}

console.log(`________________________________________________________________`);

console.log(`Скласти розклад на тиждень за домопоги switch. Користувач вводить
порядковий номер дня тижня і на екрані відображається інфа що заплановано
на цей день (можна замість плану на день, назву дня англійською).`);

let i = 3;

switch (i) {
    case 1:
        console.log('Monday');
        break;
    case 2:
        console.log('Tuesday');
        break;
    case 3:
        console.log('Wednesday');
        break;
    case 4:
        console.log('Thursday');
        break;
    case 5:
        console.log('Friday');
        break;
    case 6:
        console.log('Saturday');
        break;
    case 7:
        console.log('Sunday');
        break;
    default:
        console.log("Нет таких значений");
}

console.log(`________________________________________________________________`);

console.log(`Користувач вводить або має два числа.Потрібно знайти та вивести
максимальне число з тих двох. Також потрібно врахувати коли введені рівні числа.`);

let numberOne = -19, numberTwo = 25;

let result;

// let numberOne = +prompt('Будьласка, введіть перше число: ', 0);
// let numberTwo = +prompt('Будьласка, введіть друге число: ', 0);

result = numberOne == numberTwo ? `Число ${numberOne} дорівнює ${numberTwo}` :
        (numberOne > numberTwo ? `Число ${numberOne} больше чем ${numberTwo}` :
            `Число ${numberOne} меньше чем ${numberTwo}`);

console.log(result);

console.log(`________________________________________________________________`);

console.log(`Є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  
і тд включно). Напишіть код який, за допомоги  оператора || буде присвоювати змінній х значення "default"  
якщо значення змінної х являється falsy (хибноподыбне, тобто кастується до false)`);

let y = "";

if (y == false || y == null || y == undefined || y == 0 || y == -0 || y == 0n ||
    y == NaN || y == "") {
    console.log(`default`);
} else {
    console.log(`error`);
}

console.log(`________________________________________________________________`);

if (!y) {
    console.log(`default`);
} else {
    console.log(`error`);
}

console.log(`________________________________________________________________`);










